# Домашнее задание 1 (5 баллов).

Все задания ниже имеют равный вес (5/16).

In [324]:
import pandas as pd

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [325]:
info_table = pd.read_csv("./Data/Data/Students_info_{}.csv".format(0))
marks_table = pd.read_csv("./Data/Data/Students_marks_{}.csv".format(0))

for i in range(1, 10):
    info_table_new = pd.read_csv("./Data/Data/Students_info_{}.csv".format(i))
    marks_table_new = pd.read_csv("./Data/Data/Students_marks_{}.csv".format(i))
    info_table = pd.concat([info_table, info_table_new])
    marks_table = pd.concat([marks_table, marks_table_new])

info_table = info_table.set_index(["index"])
marks_table = marks_table.set_index(["index"])

df = info_table.join(marks_table)
df.reset_index(inplace=True)
df.head()

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,1,female,group C,some college,standard,completed,group1,69,90,88
2,2,female,group B,master's degree,standard,none,group1,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,4,male,group C,some college,standard,none,group1,76,78,75

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [326]:
df = df.drop(["index"], axis=1)
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 3. Выведите на экран размеры полученной таблицы

In [327]:
df.shape

(1000, 9)

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [328]:
df[["math score", "reading score", "writing score"]].describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [329]:
for column in df.columns:
    print(column+", number of NA =", df.isna()[column].sum())

gender, number of NA = 0
race/ethnicity, number of NA = 0
parental level of education, number of NA = 0
lunch, number of NA = 0
test preparation course, number of NA = 0
group, number of NA = 0
math score, number of NA = 0
reading score, number of NA = 0
writing score, number of NA = 0

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [330]:
df[["math score", "reading score", "writing score"]].mean()

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [331]:
grouped_students = df.groupby("test preparation course")
grouped_students[["math score", "reading score", "writing score"]].mean()

                         math score  reading score  writing score
test preparation course
completed                 69.695531      73.893855      74.418994
none                      64.077882      66.534268      64.504673

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [355]:
df.groupby("lunch")["gender"].count().head()

lunch
free/reduced    355
standard        645
Name: gender, dtype: int64

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [333]:
df.rename(columns={"parental level of education": "education", "test preparation course": "test preparation"}, inplace=True)
df.head(3)

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93

**Зафиксируем минимальный балл для сдачи экзамена**

In [334]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark > 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [335]:
df["pass math"] = df["math score"].apply(lambda s: s > passmark)
print(df["pass math"].sum() / 10, "процентов студентов сдали экзамен по математике")

85.0 процентов студентов сдали экзамен по математике

In [336]:
dp = df.groupby(by = ['test preparation','pass math'])["gender"].count()
print(100 * dp[1] / (dp[0] + dp[1]), "процентов студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике")
dp

90.78212290502793 процентов студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике

test preparation  pass math
completed         False         33
                  True         325
none              False        117
                  True         525
Name: gender, dtype: int64

In [337]:
dnpf = df.groupby(by = ['gender','test preparation','pass math'])["group"].count()
print(100 * dnpf[2] / (dnpf[2] + dnpf[3]), "женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике")
dnpf

23.353293413173652 женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике

gender  test preparation  pass math
female  completed         False         19
                          True         165
        none              False         78
                          True         256
male    completed         False         14
                          True         160
        none              False         39
                          True         269
Name: group, dtype: int64

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [338]:
df.groupby("race/ethnicity")['reading score'].apply(lambda x: x.mean())

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64

In [339]:
import time
start_time = time.time()
df.groupby("race/ethnicity")['reading score'].apply(lambda x: x.mean())
print("--- %s seconds ---" % (time.time() - start_time))

--- 0.0029921531677246094 seconds ---

In [340]:
df.groupby("education")["writing score"].min()

education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64

In [341]:
start_time = time.time()
df.groupby("education")["writing score"].min()
print("--- %s seconds ---" % (time.time() - start_time))

--- 0.0009975433349609375 seconds ---

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [342]:
df.rename(columns = {"race/ethnicity": "race", "reading score": "reading", "writing score": "writing"}, inplace=True)
df.head(3)

,gender,race,education,lunch,test preparation,group,math score,reading,writing,pass math
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,True
1,female,group C,some college,standard,completed,group1,69,90,88,True
2,female,group B,master's degree,standard,none,group1,90,95,93,True

In [343]:
def mean_sc():
    res = {}
    for i in df["race"]: # проходимся по всем значениям столбца а
        if i not in res.keys(): # если ключа - уникального значения нет - добавляем
            ind_list = df.race[df.race == i].index.tolist() # лист со всеми индексами этого ключа
            res[i] = list(df["reading"][j] for j in ind_list)   # по индексам выводим значения из столбца в 
        else:
            continue
    
    for m in res.keys():
        res[m] = sum(res[m])/len(res[m])
    return res
            
mean_sc()

{'group B': 67.35263157894737,
 'group C': 69.10344827586206,
 'group A': 64.67415730337079,
 'group D': 70.03053435114504,
 'group E': 73.02857142857142}

In [344]:
start_time = time.time()
mean_sc()
print("--- %s seconds ---" % (time.time() - start_time))
# получилось в 10 раз медленнее

--- 0.034905433654785156 seconds ---

In [345]:
def find_min():
    res = {}
    for i in df["education"]: # проходимся по всем значениям столбца а
        if i not in res.keys(): # если ключа - уникального значения нет - добавляем
            ind_list = df.education[df.education == i].index.tolist() # лист со всеми индексами этого ключа
            res[i] = list(df["writing"][j] for j in ind_list)   # по индексам выводим значения из столбца в 
        else:
            continue
    
    for m in res.keys():
        res[m] = min(res[m])
    return res

find_min()

{"bachelor's degree": 38,
 'some college': 19,
 "master's degree": 46,
 "associate's degree": 35,
 'high school': 15,
 'some high school': 10}

In [346]:
start_time = time.time()
find_min()
print("--- %s seconds ---" % (time.time() - start_time))
# получилось в 17 раз медленнее

--- 0.03790140151977539 seconds ---

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [347]:
only_numb = df.drop(['race', 'lunch', 'test preparation', 'group', 'pass math'], axis=1)
only_numb

     gender           education  math score  reading  writing
0    female   bachelor's degree          72       72       74
1    female        some college          69       90       88
2    female     master's degree          90       95       93
3      male  associate's degree          47       57       44
4      male        some college          76       78       75
..      ...                 ...         ...      ...      ...
995  female     master's degree          88       99       95
996    male         high school          62       55       55
997  female         high school          59       71       65
998  female        some college          68       78       77
999  female        some college          77       86       86

[1000 rows x 5 columns]

In [348]:
grouped = pd.pivot_table(data=only_numb,index=['gender', 'education'])
grouped

                           math score    reading    writing
gender education
female associate's degree   65.250000  74.120690  74.000000
       bachelor's degree    68.349206  77.285714  78.380952
       high school          59.351064  68.202128  66.691489
       master's degree      66.500000  76.805556  77.638889
       some college         65.406780  73.550847  74.050847
       some high school     59.296703  69.109890  68.285714
male   associate's degree   70.764151  67.433962  65.405660
       bachelor's degree    70.581818  68.090909  67.654545
       high school          64.705882  61.480392  58.539216
       master's degree      74.826087  73.130435  72.608696
       some college         69.009259  64.990741  63.148148
       some high school     67.840909  64.693182  61.375000

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [349]:
# я в 10 создала аналогичный столбец - удалю и сделаю красиво
df.drop(['pass math'], axis=1, inplace = True)
df.head(3)

,gender,race,education,lunch,test preparation,group,math score,reading,writing
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93

In [353]:
df["Math_PassStatus"] = df["math score"].apply(lambda x: "F" if x < passmark else "P")
df["Reading_PassStatus"] = df["reading"].apply(lambda x: "F" if x < passmark else "P")
df["Writing_PassStatus"] = df["writing"].apply(lambda x: "F" if x < passmark else "P")
df.tail(3)

,gender,race,education,lunch,test preparation,group,math score,reading,writing,Math_PassStatus,Reading_PassStatus,Writing_PassStatus
997,female,group C,high school,free/reduced,completed,group10,59,71,65,P,P,P
998,female,group D,some college,standard,completed,group10,68,78,77,P,P,P
999,female,group D,some college,free/reduced,none,group10,77,86,86,P,P,P

In [356]:
# количество сдавших математику
df.groupby("Math_PassStatus")["gender"].count().head()

Math_PassStatus
F    135
P    865
Name: gender, dtype: int64

In [360]:
# количество сдавших чтение
df.groupby("Reading_PassStatus")["gender"].count().head()

Reading_PassStatus
F     90
P    910
Name: gender, dtype: int64

In [359]:
# количество сдавших письмо
df.groupby("Writing_PassStatus")["gender"].count().head()

Writing_PassStatus
F    114
P    886
Name: gender, dtype: int64

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [370]:
df["OverAll_PassStatus"] = df['Writing_PassStatus'] + df['Reading_PassStatus'] + df['Math_PassStatus']
df["OverAll_PassStatus"] = df["OverAll_PassStatus"].apply(lambda x: "F" if 'F' in x else "P")
df.head(5)

,gender,race,education,lunch,test preparation,group,math score,reading,writing,Math_PassStatus,Reading_PassStatus,Writing_PassStatus,OverAll_PassStatus
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,P,P,P,P
1,female,group C,some college,standard,completed,group1,69,90,88,P,P,P,P
2,female,group B,master's degree,standard,none,group1,90,95,93,P,P,P,P
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F,P,F,F
4,male,group C,some college,standard,none,group1,76,78,75,P,P,P,P

In [379]:
print('Количество студентов, сдавших все экзамены:', sum(df["OverAll_PassStatus"] == "P"))

Количество студентов, сдавших все экзамены: 812

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####    больше 90 = A
####      80-90 = B
####      70-80 = C
####      60-70 = D
####      50-60 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

In [390]:
def GetGrade(average_mark):
    if average_mark > 90:
        return 'A'
    elif 80 < average_mark <= 90:
        return 'B'
    elif 70 < average_mark <= 80:
        return 'C'
    elif 60 < average_mark <= 70:
        return 'D'
    elif 50 < average_mark <= 60:
        return 'E'
    else:
        return 'F'

In [393]:
df["Grade"] = (df['math score'] + df['reading'] + df['writing'])/3
df["Grade"] = df["Grade"].apply(lambda x: GetGrade(x))
df.head(5)

,gender,race,education,lunch,test preparation,group,math score,reading,writing,Math_PassStatus,Reading_PassStatus,Writing_PassStatus,OverAll_PassStatus,Grade
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,P,P,P,P,C
1,female,group C,some college,standard,completed,group1,69,90,88,P,P,P,P,B
2,female,group B,master's degree,standard,none,group1,90,95,93,P,P,P,P,A
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F,P,F,F,F
4,male,group C,some college,standard,none,group1,76,78,75,P,P,P,P,C

In [394]:
df.groupby('Grade')['gender'].count()

Grade
A     50
B    144
C    253
D    260
E    184
F    109
Name: gender, dtype: int64